BaseConfiguration/Money_2_0/Enums/ТипыПровайдеровREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПровайдеровREST</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Яндекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dropbox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Google</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonForms/АвторизацияOAUTH/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//ОбщаяФорма.АвторизацияOAUTH.
//  Предоставляет возможность авторизовать приложение или отменить авторизацию в облачных сервисах
//  
//Параметры формы:
//  ОтменаАвторизации - Булево - если Истина, пользователь должен подтвердить отмену авторизации
//  Провайдер - ПеречислениеСсылка.ТипыПровайдеровREST - провайдер, чьей авторизацией управляет эта форма
//  
////////////////////////////////////////////////////////////////////////////////
&НаКлиенте 
Перем ВыполняетсяПроверкаПередЗакрытием;



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Провайдер,ОтменаАвторизации");
	
	Если Не ЗначениеЗаполнено(Провайдер) Тогда
		Провайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Провайдер) Тогда
		ВызватьИсключение НСтр("ru='Не указан провайдер облачного сервиса, в котором нужно авторизовать приложение'");
	КонецЕсли;
	
	RESTВызовСервера.ПроверитьСвойстваАккаунтаИПровайдера(Провайдер, СвойстваАккаунта, СвойстваПровайдера);
	
	Если ОтменаАвторизации Тогда
		
		Заголовок = СтрШаблон(НСтр("ru='Отмена авторизации в %1'"), Строка(Провайдер)); 
		
		Элементы.СтраницаАвторизации.Видимость = Ложь;
		Если Провайдер = Перечисления.ТипыПровайдеровREST.Яндекс Тогда
			Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОтменыАвторизацииЯндекс;
		Иначе
			Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОтменыАвторизации;
			Элементы.СтраницаОтменыАвторизацииЯндекс.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ПодготовитьСвойстваПровайдераКАвторизации();
		Заголовок = СтрШаблон(НСтр("ru='Авторизация в %1'"), Строка(Провайдер)); 
		
	КонецЕсли;
	
	ПериодОжидания = 11;
	КонтрольнаяСтрока = ПрефиксСтатусСтрокиПровайдера(Провайдер) + Формат(ТекущаяДатаСеанса(), "ДФ=ггММдд-ЧЧ-мм-сс");
	СвойстваПровайдера.Вставить("КонтрольнаяСтрока", КонтрольнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтменаАвторизации И Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		
		ОбновитьСтраницуОтменыЯндекс();
		
	ИначеЕсли Не ОтменаАвторизации Тогда
		
		ОбновитьСтраницуАвторизации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ПроверитьКодДоступа");
	
	Если ВыполняетсяПроверкаПередЗакрытием = Неопределено Тогда
		// Форму закрывают до окончания проверки
		
		Если ОтменаАвторизации И Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
			// проверка отмены авторизации
			
			Отказ = Истина;
			ВыполняетсяПроверкаПередЗакрытием = Истина;
			ПроверитьОтменуАвторизации();
			
		ИначеЕсли Не ОтменаАвторизации И (Не КодДоступаПроверен Или ЗначениеЗаполнено(КодДоступа) И Не ТокенОбработан) Тогда 
			// проверка кода и токена доступа
			
			Отказ = Истина;
			ВыполняетсяПроверкаПередЗакрытием = Истина;
			
			Если Не КодДоступаПроверен Тогда
				ПроверитьКодДоступа();
			Иначе
				ПолучитьТокенДоступа();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура HTMLДокументДокументСформирован(Элемент)
	
	Если ОтменаАвторизации Тогда
		Возврат;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент Тогда
		Возврат;
	#Иначе
		
		СсылкаЭлемента = Элементы.HTMLДокумент.Документ.location.href;
		Если СтрНайти(СсылкаЭлемента, СвойстваПровайдера.СтраницаОк) > 0
			Или СтрНайти(СсылкаЭлемента, СвойстваПровайдера.СтраницаОжидания) > 0
			Или СтрНайти(СсылкаЭлемента, СвойстваПровайдера.СтраницаОшибки) > 0 Тогда
			
			ОтключитьОбработчикОжидания("ПроверитьКодДоступа");
			ПериодОжидания = ПериодОжидания + 1;
			ПроверитьКодДоступа();
			
		КонецЕсли;
		
	#КонецЕсли		
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеАвторизации2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗапросВоВнешнемБраузере();
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ОменитьАвторизацию(Команда)
	ОтменитьАвторизациюПрограммно();
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиПоURL(URL)

	#Если МобильноеПриложениеКлиент Тогда
		Текст= "window.location = '" + URL + "';";
		Текст = "<html><body onload="""+Текст+"""></body></html>";
		HTMLдокумент = Текст;
	#Иначе
		HTMLДокумент = URL;
		ОбновитьОтображениеДанных(Элементы.HTMLДокумент);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьСтраницуОтменыЯндекс()

	ПерейтиПоURL("https://passport.yandex.ru/profile");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросВоВнешнемБраузере()
	
	ПериодОжидания = 11;
	ОтключитьОбработчикОжидания("ПроверитьКодДоступа");
	
	// Генерируем адресную строку для браузера
	КонтрольнаяСтрока = КонтрольнаяСтрока + "-br";
	СвойстваПровайдера.Вставить("КонтрольнаяСтрока", КонтрольнаяСтрока);
	Адрес = АдресАвторизации();
	
	// Открытие страницы авторизации
	ЗапуститьПриложение(Адрес);
	ПерейтиПоURL(СвойстваПровайдера.СтраницаОжидания);
	
	// Подключение обработчика ожидания
	ПодключитьПроверкуКода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницуАвторизации()

	ПериодОжидания = 11;
	ОтключитьОбработчикОжидания("ПроверитьКодДоступа");
	
	ПерейтиПоURL(АдресАвторизации());
	
	ПодключитьПроверкуКода();

КонецПроцедуры

&НаКлиенте
Функция АдресАвторизации()

	Если Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Dropbox") Тогда
		Возврат ЗапросDropbox();
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		Возврат ЗапросЯндекс();
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		Возврат ЗапросGoogle();
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ЗапросDropbox()

	// Генерируем адресную строку для браузера
	Адрес = "HTTPS://" + СвойстваПровайдера.СерверАвторизации + "/" + СвойстваПровайдера.АдресАвторизации;
	Адрес = Адрес + "?";
	Адрес = Адрес + "client_id=" + СвойстваПровайдера.Идентификатор;
	Адрес = Адрес + "&response_type=" + "code"; 
	Адрес = Адрес + "&redirect_uri=" + СвойстваПровайдера.CallbackURL;
	Адрес = Адрес + "&state=" + КонтрольнаяСтрока;
	Адрес = Адрес + "&force_reapprove=true"; 
	
	Возврат Адрес;

КонецФункции

&НаКлиенте
Функция ЗапросЯндекс(Принудительно = Ложь)

	// Генерируем адресную строку для браузера
	Адрес = "HTTPS://" + СвойстваПровайдера.СерверАвторизации + "/" + СвойстваПровайдера.АдресАвторизации;
	Адрес = Адрес + "?";
	Адрес = Адрес + "client_id=" + СвойстваПровайдера.Идентификатор;
	Адрес = Адрес + "&response_type=" + "code"; 
	Адрес = Адрес + "&state=" + КонтрольнаяСтрока;
	Адрес = Адрес + "&force_confirm=true"; 
	
	Возврат Адрес;

КонецФункции

&НаКлиенте
Функция ЗапросGoogle(Принудительно = Ложь)

	// Генерируем адресную строку для браузера
	Адрес = "HTTPS://" + СвойстваПровайдера.СерверАвторизации + "/o/oauth2/v2/auth";
	Адрес = Адрес + "?";
	Адрес = Адрес + "client_id=" + СвойстваПровайдера.Идентификатор;
	Адрес = Адрес + "&redirect_uri=" + RESTСлужебныйВызовСервера.КодироватьСтрокуКакURL(СвойстваПровайдера.CallbackURL);
	Адрес = Адрес + "&response_type=code"; 
	Адрес = Адрес + "&scope=" + RESTСлужебныйВызовСервера.КодироватьСтрокуКакURL("https://www.googleapis.com/auth/drive.appdata https://www.googleapis.com/auth/drive.file https://www.googleapis.com/auth/drive.metadata https://www.googleapis.com/auth/userinfo.profile https://www.googleapis.com/auth/userinfo.email");
	Адрес = Адрес + "&state=" + КонтрольнаяСтрока;
	Адрес = Адрес + "&include_granted_scopes=true"; 
	Адрес = Адрес + "&prompt=consent"; 
	//Адрес = Адрес + "&approval_prompt=force"; 
	Адрес = Адрес + "&access_type=offline"; 
	
	Возврат Адрес;

КонецФункции

&НаСервере
Процедура ПодготовитьСвойстваПровайдераКАвторизации()
	
	СвойстваПровайдера.Вставить("СерверШлюза", "money1c.com");
	СвойстваПровайдера.Вставить("АдресШлюза", "a/dev_money/50/hs/extesupp/auth/getcode");
	КодПровайдера = "";
	
	Если Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Dropbox") Тогда
		
		СвойстваПровайдера.Вставить("СерверАвторизации", "www.dropbox.com");
		СвойстваПровайдера.Вставить("АдресАвторизации", "oauth2/authorize");
		КодПровайдера = "dropbox";
		
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		
		СвойстваПровайдера.Вставить("СерверАвторизации", "oauth.yandex.ru");
		СвойстваПровайдера.Вставить("АдресАвторизации", "authorize");
		КодПровайдера = "yandex";
		
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		
		СвойстваПровайдера.Вставить("СерверАвторизации", "accounts.google.com");
		СвойстваПровайдера.Вставить("АдресАвторизации", "o/oauth2/v2/auth");
		КодПровайдера = "google";
		
	КонецЕсли;
	
	АдресСтраницы = "https://money1c.com/a/dev_money/50/hs/extesupp/auth/statuspage/%1/%2";
	СвойстваПровайдера.Вставить("СтраницаОК", СтрШаблон(АдресСтраницы, КодПровайдера, "ok"));
	СвойстваПровайдера.Вставить("СтраницаОшибки", СтрШаблон(АдресСтраницы, КодПровайдера, "err"));
	СвойстваПровайдера.Вставить("СтраницаОжидания", СтрШаблон(АдресСтраницы, КодПровайдера, "wait"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксСтатусСтрокиПровайдера(Провайдер)

	Если Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Dropbox") Тогда
		Возврат "db_";
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Яндекс") Тогда
		Возврат "yd_";
	ИначеЕсли Провайдер = ПредопределенноеЗначение("Перечисление.ТипыПровайдеровREST.Google") Тогда
		Возврат "gg_";
	КонецЕсли;

	Возврат "" ;
	
КонецФункции


&НаКлиенте
Процедура ПодключитьПроверкуКода()

	Если ПериодОжидания < -10 Или КодДоступаПроверен Или ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОжидания = ПериодОжидания - 1;
	ПодключитьОбработчикОжидания("ПроверитьКодДоступа", Макс(ПериодОжидания, 1), Истина);

КонецПроцедуры

&НаСервере
Функция ПроверитьКодДоступаНаСерврере()
	
	Результат = Новый Структура("ЕстьОшибки,ТекстОшибки,КодСостояния,КодДоступа",
				Ложь, "", Неопределено, Неопределено);
	
	Ответ = RESTВызовСервера.ВыполнитьHTTPЗапрос("GET", СвойстваПровайдера.СерверШлюза, СвойстваПровайдера.АдресШлюза+ "?state=" + КонтрольнаяСтрока, "", , , Истина);
	
	Если Ответ = Неопределено Тогда
		
		// не удалось выполнить запрос
		Результат.ЕстьОшибки = Истина;
		Результат.ТекстОшибки = НСтр("ru='Кажется, сервер сейчас недоступен. Повторите попытку позже'");
		Возврат Результат;
		
	КонецЕсли;
	
	// Обработка кода в ответе сервера
	ПоляОтвета = ?(Ответ.КодСостояния = 200, 
			RESTВызовСервера.СоответствиеИзHTTPОтвета(Ответ),
			Неопределено);
	Если Ответ.КодСостояния <> 200 Тогда 
		
		Результат.ЕстьОшибки = Истина;
		Результат.ТекстОшибки = СтрШаблон(НСтр("ru='Сервер поддержки авторизации вернул код %1
			|Попробуйте повторить попытку позже'"), 
				Результат.КодСостояния);
		Возврат Результат;
		
	ИначеЕсли ПоляОтвета = Неопределено  
		Или ПоляОтвета.Получить("response") = Неопределено Тогда
		Результат.ЕстьОшибки = Истина;
		Результат.ТекстОшибки = НСтр("ru='Не удалось получить код доступа с сервера поодержки авторизации. 
			|Повторите попытку позже'"); 
		Возврат Результат;
		
	КонецЕсли;
	
	// Обработка содержимого ответа сервера
	Результат.КодСостояния = ПоляОтвета.Получить("response");
	ТелоОтвета             = ПоляОтвета.Получить("body");
	СообщениеСервера       = ПоляОтвета.Получить("message");
	
	
	Результат.ЕстьОшибки = Результат.КодСостояния <> 30204 // код доступа еще не получен 
			И Результат.КодСостояния <> 30200; // код доступа получен
	Результат.ТекстОшибки = СообщениеСервера;
	
	Если ТелоОтвета <> Неопределено Тогда
		
		КодИзОтвета = ТелоОтвета.Получить("КодДоступа");
		Если ЗначениеЗаполнено(КодИзОтвета) Тогда
			//Код должен быть строкой!
			Если ТипЗнч(КодИзОтвета) = Тип("Число") Тогда
				Результат.КодДоступа = Формат(КодИзОтвета, "ЧДЦ=; ЧГ=");
			Иначе
				Результат.КодДоступа = КодИзОтвета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получение кода доступа с транзитного сервера
&НаКлиенте
Процедура ПроверитьКодДоступа()

	Если КодДоступаПроверен Тогда
		
		Если ЗначениеЗаполнено(КодДоступа) И Не ТокенОбработан Тогда
			ПолучитьТокенДоступа();
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	РезультатПроверки = ПроверитьКодДоступаНаСерврере();
	
	Если РезультатПроверки.ЕстьОшибки Тогда
	
		#Если ВебКлиент Тогда
			Сообщить(РезультатПроверки.ТекстОшибки);
		#Иначе
			Предупреждение(РезультатПроверки.ТекстОшибки);
		#КонецЕсли
		АвтоматическоеЗакрытиеФормы();
		Возврат;
			
	ИначеЕсли РезультатПроверки.КодСостояния = 30204 Тогда 
		// Если контрольная строка еще не попала в шлюз, продолжаем обработку ожижания
		
		Если ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
			АвтоматическоеЗакрытиеФормы();
		Иначе
			ПодключитьПроверкуКода();
		КонецЕсли;
		Возврат;
			
	КонецЕсли;

	// все иные ответы завершают периодическую проверку кода
	КодДоступаПроверен = Истина;
	КодДоступа = РезультатПроверки.КодДоступа;
	
	Если ЗначениеЗаполнено(КодДоступа) Тогда
		
		ПолучитьТокенДоступа();
		
	Иначе
		ПоказатьСтраницуОшибкиССообщением(НСтр("ru='Что-то пошло не так: возвращен пустой код доступа'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуОшибкиССообщением(ТекстСообщения)

	Сообщить(ТекстСообщения);
	ПерейтиПоURL(СвойстваПровайдера.СтраницаОшибки);
	
	Если ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
		АвтоматическоеЗакрытиеФормы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТокенДоступа()

	Если ТокенОбработан Или Не ЗначениеЗаполнено(КодДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	ТокенОбработан = Истина;
	Результат = RESTВызовСервера.ОбменятьКодДоступаНаТокен(Провайдер, КодДоступа, СвойстваПровайдера);
	
	Если Результат.ВыполненоУспешно Тогда
		
		Токен               = Результат.Токен;
		
		ЗаписатьСвойстваАккаунтаКлиент();
		
	Иначе
		
		ПоказатьСтраницуОшибкиССообщением(СтрШаблон(НСтр("ru='Ошибка при получении токена: %1 %2'"), Символы.ПС + Результат.КодСостояния + ": ", Результат.ПредставлениеОшибки ));
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСвойстваАккаунтаКлиент()

	СвойстваАккаунта.КлючАвторизации = Токен;
	СвойстваАккаунта.Провайдер       = Провайдер;
	
	// Обновляем представление аккаунта
	Результат = RESTВызовСервера.ОбновитьСвойстваАккаунта(Провайдер, СвойстваАккаунта);
	Если Не Результат.ВыполненоУспешно Тогда
		ПоказатьСтраницуОшибкиССообщением(СтрШаблон(НСтр("ru='Ошибка при получении сведений об аккаунте: %1 %2'"), Символы.ПС + Результат.КодСостояния + ": ", Результат.ПредставлениеОшибки ));
		Возврат;
	КонецЕсли;
	
	ЗаписатьСвойстваАккаунтаСервер();
	ОповеститьОбАвторизации();

	Если ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
		АвтоматическоеЗакрытиеФормы();
	Иначе
		ПодключитьОбработчикОжидания("АвтоматическоеЗакрытиеФормы", 3, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСвойстваАккаунтаСервер()

	// Сохраяем свойства аккаунта
	RESTСлужебныйВызовСервера.ОбновитьПараметрСеанса(СвойстваАккаунта);
	RESTСлужебныйВызовСервера.СохранитьПараметрыREST();

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбАвторизации()

	ПерейтиПоURL(СвойстваПровайдера.СтраницаОК);
	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='Приложение авторизовано в %1'"), Строка(Провайдер))); 
	Оповестить("RESTАвторизован", Провайдер, ЭтотОбъект);	

КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеЗакрытиеФормы()

	ВыполняетсяПроверкаПередЗакрытием = Истина;
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАвторизациюПрограммно()

	Результат = RESTВызовСервера.ОтменитьАвторизациюВОблаке(Провайдер, СвойстваАккаунта, СвойстваПровайдера);
	Если Результат.ВыполненоУспешно Тогда
		Сообщить(СтрШаблон(НСтр("ru='Ошибка при отмене авторизации: %1 %2'"), Символы.ПС + Результат.КодСостояния + ": ", Результат.ПредставлениеОшибки ));
		Возврат;
	КонецЕсли;
	
	ОчиститьАвторизациюСервер();
	ОповеститьОбОтменеАвторизации();
	АвтоматическоеЗакрытиеФормы();

КонецПроцедуры


&НаКлиенте
Процедура ПроверитьОтменуАвторизации()

	Результат = RESTВызовСервера.ОбновитьСвойстваАккаунта(Провайдер, СвойстваАккаунта);
	Если Результат.ВыполненоУспешно Тогда
		
		Сообщить(НСтр("ru='Не удалось отменить авторизацию!'"));
		Если ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
			АвтоматическоеЗакрытиеФормы();
		КонецЕсли;
		Возврат;
		
	КонецЕсли;

	ОчиститьАвторизациюСервер();
	ОповеститьОбОтменеАвторизации();
	
	Если ВыполняетсяПроверкаПередЗакрытием <> Неопределено Тогда
		АвтоматическоеЗакрытиеФормы();
	Иначе
		ПодключитьОбработчикОжидания("АвтоматическоеЗакрытиеФормы", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьАвторизациюСервер()

	СвойстваАккаунта.КлючАвторизации       = "";
	СвойстваАккаунта.ИДАккаунта            = "";
	СвойстваАккаунта.ПредставлениеАккаунта = "";
	ЗаписатьСвойстваАккаунтаСервер();

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОтменеАвторизации()

	ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='Отменена авторизация приложение в %1'"), Строка(Провайдер))); 
	Оповестить("RESTВыход", Провайдер, ЭтотОбъект);	

КонецПроцедуры


#КонецОбласти
